src/InformationRegisters/ИсторияОбменаССайтом_ЗаявкиПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОбменаССайтом_ЗаявкиПокупателей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СообщениеОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПринятого</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОтправителя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПолучателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИсторияОбменаССайтом_ЗаявкиПокупателей/Ext/ManagerModule.bsl
Процедура ЗарегистрироватьСообщение(ИдентификаторОтправителя, ИдентификаторПолучателя, СообщениеОбмена, НомерПринятого) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	Запись = РегистрыСведений.ИсторияОбменаССайтом_ЗаявкиПокупателей.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДата();
	Запись.ИдентификаторОтправителя = ИдентификаторОтправителя;
	Запись.ИдентификаторПолучателя = ИдентификаторПолучателя;
	Запись.СообщениеОбмена = СообщениеОбмена;
	Запись.НомерПринятого = НомерПринятого;
	Запись.Записать(Истина);
	
КонецПроцедуры
